
** DONE 日本語に翻訳する
CLOSED: [2023-04-01 Sat 00:06]
地味によく分からないのが言語、国をどのように割り出すか。
- 環境変数
- current-language-environment
- 手動設定

Emacsのtutorialと似た方法を採るべきだと思う。

tutorialは次の方法で言語に対応したファイル名を取得している。

#+begin_src elisp
(get-language-info current-language-environment 'tutorial)
#+end_src

#+RESULTS:
: TUTORIAL.ja

get-language-infoはlanguage-info-alistから情報を取得している。

language-info-alistから日本語に関する部分を抜き出してみる。

#+begin_src elisp
("Japanese"
 (documentation . t)
 (sample-text . "Japanese (日本語)	こんにちは, ｺﾝﾆﾁﾊ")
 (features japan-util)
 (input-method . "japanese")
 (coding-priority iso-2022-jp japanese-iso-8bit japanese-shift-jis iso-2022-jp-2004 euc-jis-2004 japanese-shift-jis-2004 iso-2022-jp-2)
 (coding-system iso-2022-jp japanese-iso-8bit japanese-shift-jis japanese-iso-7bit-1978-irv iso-2022-jp-2004 japanese-shift-jis-2004 euc-jis-2004)
 (charset japanese-jisx0208 japanese-jisx0212 latin-jisx0201 katakana-jisx0201 japanese-jisx0213\.2004-1 japanese-jisx0213-1 japanese-jisx0213-2 japanese-jisx0208-1978)
 (tutorial . "TUTORIAL.ja")
 (iso639-language . ja)
 (exit-function . use-default-char-width-table)
 (setup-function . setup-japanese-environment-internal))
#+end_src

iso639-languageが使えるのではないか。

#+begin_src elisp
(get-language-info current-language-environment 'iso639-language)
#+end_src

#+RESULTS:
: ja

ただ、iso639-languageが設定されている言語は非常に少ない。
tutorialファイルの拡張子から取ってみてはどうか。
もしくは大人しく current-language-environment の値自体を使うか。
いや、自分で対応表を持てば十分か。
("Japanese" . "ja") => edraw-msg-ja.el
もちろん言語ファイル名を設定で直接指定出来るようにする。

current-language-environmentの変化を監視するかどうかは微妙。一応set-language-environment-hookでできるけど。とりあえずやらないでおく。起動した後に切り替える人なんて少ないからね。

後の課題はメッセージを収集する方法。gettextユーティリティのようなものが欲しい。
elファイルからメッセージを収集してメッセージカタログを更新するコマンドが必要。メッセージ使用箇所へジャンプするコマンドも欲しい。
** DONE xlink:hrefがhrefになってしまうのを何とかする
CLOSED: [2023-08-26 Sat 19:55]
とにかくSVGを読み込んだら強制的にxlink:hrefに直す。
ついでにedraw-svg-version変数を追加して2.0用の入出力も出来るようにしておく。

libxml-parse-xml-regionを使うとxlink:hrefがhrefになってしまう。
Emacs27環境で試したらxlink:hrefでは表示されていたものが保存してエディタで開き直すと表示されなくなる。Emacs29環境ではどちらも表示されるが、xlink:hrefがhrefになるのは変わらない。

#+begin_src elisp :results pp
(with-temp-buffer
  (insert "<svg width=\"560\" height=\"420\" version=\"1.1\" xmlns=\"http://www.w3.org/2000/svg\" xmlns:xlink=\"http://www.w3.org/1999/xlink\"><image x=\"240\" y=\"220\" width=\"180\" height=\"120\" xlink:href=\"steak.jpg\" /></svg>")
  (libxml-parse-xml-region (point-min) (point-max)))
#+end_src

#+RESULTS:
#+begin_example
(svg
 ((width . "560")
  (height . "420")
  (version . "1.1"))
 (image
  ((x . "240")
   (y . "220")
   (width . "180")
   (height . "120")
   (href . "steak.jpg"))))
#+end_example

修正後のテスト。

#+begin_src elisp :results pp
(let ((edraw-svg-version "1.1"))
  (edraw-svg-decode-svg "<!-- test --><svg width=\"560\" height=\"420\" version=\"1.1\" xmlns=\"http://www.w3.org/2000/svg\" xmlns:xlink=\"http://www.w3.org/1999/xlink\"><image x=\"240\" y=\"220\" width=\"180\" height=\"120\" xlink:href=\"steak.jpg\" /></svg>" nil))
#+end_src

#+RESULTS:
#+begin_example
(svg
 ((xmlns . "http://www.w3.org/2000/svg")
  (xmlns:xlink . "http://www.w3.org/1999/xlink")
  (width . "560")
  (height . "420")
  (version . "1.1"))
 (image
  ((x . "240")
   (y . "220")
   (width . "180")
   (height . "120")
   (xlink:href . "steak.jpg"))))
#+end_example

2.0だと次のようになる。

#+begin_src elisp :results pp
(let ((edraw-svg-version "2.0"))
  (edraw-svg-decode-svg "<!-- test --><svg width=\"560\" height=\"420\" version=\"1.1\" xmlns=\"http://www.w3.org/2000/svg\" xmlns:xlink=\"http://www.w3.org/1999/xlink\"><image x=\"240\" y=\"220\" width=\"180\" height=\"120\" xlink:href=\"steak.jpg\" /></svg>" nil))
#+end_src

#+RESULTS:
#+begin_example
(svg
 ((xmlns . "http://www.w3.org/2000/svg")
  (width . "560")
  (height . "420"))
 (image
  ((x . "240")
   (y . "220")
   (width . "180")
   (height . "120")
   (href . "steak.jpg"))))
#+end_example
** DONE パス編集/path d=属性の字句区切り解析を直す
CLOSED: [2024-03-02 Sat 18:25]

TobiasZawadaさんからプルリクエストあり:
[[https://github.com/misohena/el-easydraw/issues/23][comma/whitespace separators in svg path descriptors arguments are optional #23]]

数字間の空白も省略可能なのだとか！　省略可能とは知っていたけれど、数字の間を符号で区切るという発想はなかった。

https://www.w3.org/TR/SVG11/paths.html#PathDataBNF をよく見ると"M 100-200"という例がちゃんと書いてある。

プルリクエストを確認し、若干修正してもらってからマージした。

この関数([[elisp-function:edraw-path-d-parse]])には細かく見ていくといくつか問題がある。

- dの末尾まで解析が終わったか確認していない
- コマンド間の文法的な正しさを確認していない(例えば最初にMかmが来なければならないこと)
- コマンド名の正しさを確認していない
- コマンド引数の数を確認していない
- M1e2233e4を M 1e2233 e 4 と解析してしまう
- コマンド名の正規表現は大文字のみ指定されている([[elisp-variable:case-fold-search]]の影響を受ける)

ただし、この関数は[[elisp-function:edraw-path-cmdlist-from-d]]からしか呼ばれず、そこではparse後のリストをある程度チェックしている。コマンド名や引数の数はそこでエラーになる。しかしいくつかの点は相変わらずスルーされている。

- dの末尾まで解析が終わったか確認していない
- コマンド間の文法的な正しさを確認していない(例えば最初にMかmが来なければならないこと)
- コマンド名の正規表現は大文字のみ指定されている([[elisp-variable:case-fold-search]]の影響を受ける)

最初にMまたはmが来るかはとりあえず保留。万が一動かなくなっても困るし。

その他の末尾まで解析とcase-fold-searchは直した。

その他numberの連接で何かおかしな事が起きないか検討したが、一応大丈夫そう。

numberの全パターン:

11         +11
11e33      +11e33
11e+33     +11e+33
.22        +.22
.22e33     +.22e33
.22e+33    +.22e+33
11.22      +11.22
11.22e33   +11.22e33
11.22e+33  +11.22e+33
.22        +.22
.22e33     +.22e33
.22e+33    +.22e+33
11.22      +11.22
11.22e33   +11.22e33
11.22e+33  +11.22e+33
11.        +11.
11.e33     +11.e33
11.e+33    +11.e+33

- 末尾: 整数部, 小数点, 小数部, 指数
- 先頭: 符号, 整数部, 小数点

- 組み合わせ (let ((str "1e34e5")) (when (string-match (format "\\(%s\\)\\(%s\\)*" edraw-path-d-number edraw-path-d-number) str) (list (match-string 1 str) (match-string 2 str))))
  - 整数 符号     : 111+999   OK 受理(111 +999)
  - 整数 整数     : 111999    NG 受理(111999)
  - 整数 小数点   : 111.888   NG 受理(111.888 nil)
  - 小数点 符号   : 111.+999  OK 受理(111. +999)
  - 小数点 整数   : 111.999   NG 受理(111.999 nil)
  - 小数点 小数点 : 111..888  OK 受理(111. .888)
  - 小数 符号     : .222+999  OK 受理(.222 +999)
  - 小数 整数     : .222999   NG 受理(.222999 nil)
  - 小数 小数点   : .222.888  OK 受理(.222 .888)
  - 指数 符号     : 1e3+999   OK 受理(1e3 +999)
  - 指数 整数     : 1e3999    NG 受理(1e3999 nil)
  - 指数 小数点   : 1e3.888   OK 受理(1e3 .888)

1e234e5のような異常な文字列が次のような正規表現では数列の途中で区切られてしまうが……

#+begin_src elisp :results pp
(let ((str "1e234e5"))
  (when (string-match (format "\\(%s\\)%s?\\(%s\\)" edraw-path-d-number edraw-path-d-comma-wsp edraw-path-d-number) str)
    (list (match-string 1 str) (match-string 2 str))))
#+end_src

#+RESULTS:
: ("1e23" "4e5")

次のように1回以上の繰り返しの正規表現にすると単にe5の前でマッチングが終わるだけで済む。

#+begin_src elisp :results pp
(let ((str "1e234e5"))
  (when (string-match (format "\\(%s\\)\\(%s?\\(%s\\)\\)*" edraw-path-d-number edraw-path-d-comma-wsp edraw-path-d-number) str)
    (list (match-string 1 str) (match-string 2 str))))
#+end_src

#+RESULTS:
: ("1e234" nil)

その後e5がeコマンドの引数5として認識されてしまうのだけど、それは一応エラーになるので大丈夫。
** DONE テキスト内の空白が反映されないのを何とかする
CLOSED: [2025-01-06 Mon 12:51]
librsvg(2.55.90時点)はstyle="white-space:pre"を認識しない。ブラウザは認識する。xml:space="preserve"はlibrsvgもブラウザも認識する。

[[https://gitlab.gnome.org/GNOME/librsvg/-/issues/795][Implement SVG2 white-space behavior (#795) · イシュー · GNOME / librsvg · GitLab]]

ひとまず xml:space="preserve" をtext要素に指定するのが最も簡単。

しかし嫌らしいのはlibxmlがXML名前空間を捨ててしまうということ。

#+begin_src elisp :results pp
(edraw-svg-decode-xml "<text xml:space='preserve'>TEXT   DESU   </text>" nil)
#+end_src

#+RESULTS:
: (text ((space . "preserve")) "TEXT   DESU   ")

幸いSVGにはspace属性などというものは無いので、space属性を出力するときはxml:を付けるという回避策が可能。酷いけどlibxmlを使う以上酷い解決策は避けられない。以前行ったことがある回避策としては、parse前に名前空間を特殊な表記に置き換えて、parseした後に名前空間に戻すという手法。本当にバカバカしい。なのでedraw-svg-printでspace属性を出力するときはxml:spaceを出力する。

後はテキストを作成するときに必ずspace属性を指定してしまう。無駄かもしれないけどしょうがない。
** CANCELLED Emacs27でテキスト装飾機能に問題がある
CLOSED: [2025-01-12 Sun 19:52]
- M-oのキーバインドが正しく表示されない。
  substitute-command-keysがfacemenu-keymapを検出してくれない。Emacs28からは大丈夫。
- 入れ子になったtspanに座標が引き継がれない。おそらく古いlibrsvgのバグ。Emacs28以降やブラウザでは問題なく表示される。

+正直Emacs27は装飾機能を無効化しても良いかもしれない。+

Emacs27まではM-oはグローバルマップに割り当てられていた。Emacs28からは必要なモード等だけでローカルに割り当てるように変わった。

Emacs27では関数定義にキーマップをバインドしたシンボルに対するsubstitute-command-keysに何かおかしな挙動がある。

#+begin_src elisp
(progn
  (defvar my-test-keymap nil)
  (setq my-test-keymap (let ((km (make-sparse-keymap "Test"))) (define-key km (kbd "a") 'my-test-a) km))
  (defalias 'my-test-keymap my-test-keymap)
  (defun my-test-a () (interactive) (message "AAAA"))

  (defvar my-test-keymap2 nil)
  (setq my-test-keymap2 (let ((km (make-sparse-keymap))) (define-key km (kbd "C-c d") 'my-test-keymap) km))
  (substitute-command-keys
   "\\<my-test-keymap2>\\[my-test-keymap]"))
#+end_src

#+RESULTS:
: C-c d

これがEmacs27だと結果は ~M-x my-test-keymap~ になる。

おそらくEmacs28で修正されたバグではないか。facemenu-keymapをグローバルから外したときに気がついて修正したとか？

次のコードだとEmacs27でもEmacs30でも正しく動作する。

#+begin_src elisp
;; nilのときは空文字列になる
(key-description
 ;; 割り当てが見つからなければnilを返す
 (where-is-internal 'my-test-keymap (list my-test-keymap2) t))
#+end_src

#+RESULTS:
: C-c d

~(list my-test-keymap2)~ のところが単にmy-test-keymap2だとなぜか見つからない(Emacs30でも)。

よく分からないけど [[https://github.com/emacs-mirror/emacs/commit/120ade62cd26dd502f1ae3784079e4cd88607a0b][Allow keymap to override advertised-binding in docstrings · emacs-mirror/emacs@120ade6]] かな？

試しにwhere-is-internalを使う用に修正してみたが、結局古いlibrsvgの問題で装飾文字が正しい位置に表示されない。

Emacs27ではM-oを表示しないようにして、できるだけ文字装飾機能の存在を隠した方が良い。
